Version2/TestTool-NOP.13.12.SR1/TestTool.Setup/Requests/AccessControl/ExternalAuthorization/General.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:tac="http://www.onvif.org/ver10/accesscontrol/wsdl">
   <soap:Header/>
   <soap:Body>
      <tac:ExternalAuthorization>
        <tac:AccessPointToken>tokenAccessPoint1</tac:AccessPointToken>
        <!--Optional-->
        <tac:CredentialToken>tokenAccessPoint2</tac:CredentialToken>
        <!--Optional-->
        <tac:Reason>reason</tac:Reason>
        <tac:Decision>Granted</tac:Decision>
      </tac:ExternalAuthorization>
   </soap:Body>
</soap:Envelope>